---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalMember.FlipCurve
source: html/b59e2918-471d-1e72-68fb-22fdc4ce7124.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalMember.FlipCurve Method

Flip the Analytical Member

## Syntax (C#)
```csharp
public void FlipCurve()
```